training/relational-model/relational-notes.org
#+TITLE: The Relational Model
#+AUTHOR: James Geddes
#+DATE: 27 November 2017

#+SETUPFILE: theme-readtheorg.setup

#+HTML_DOCTYPE: html5

# html-style:nil 
#+OPTIONS: html5-fancy:t 

# #+HTML_HEAD: <link rel="stylesheet" href="tufte.css">

#+startup: showall

* Introduction

** What is data?

#+BEGIN_quote
Question 1: What is data?
#+END_quote

# Facts?
# Objects?
# Triples?
# Pointers?
# Documents?
# Hierarchies?

# The relational model is interested in modelling /facts/. 

** What level are we going to talk about?

# Hand-drawn figure on the whiteboard here

From abstract to concrete:

1. The *conceptual* model is the mathematics of facts: it is expressed using
   set-theoretic notions.

2. The *logical* model describes how the conceptual model is represented and
   manipulated by a computer. It is the level of SQL, the language with which
   you interact with the database.

3. The *physical* model is the “back-end”: it describes how the bits are
   organised within a computer, how your commands are understood and compiled,
   and the mechanics of computation on data. 

We will talk exclusively about the conceptual and logical levels. The main
challenge in this subject is that very few existing database systems correctly
implement the conceptual model.

** Challenges

- Most database systems incorrectly implement the conceptual level 
- Most practitioners know only the logical level
- Much real-world code drags in the physical level where it doesn't belong


* The conceptual model

** Example A: House Prices

Look at [[file:data/median-house-price-by-lad.csv]]

#+begin_quote
Question 2: What does this data look like?

- What kind of structure is this?
- What regularities can you see?
- What anomalies are there?
- Would you make any structural changes?
#+end_quote

# Anomalies include: nulls, blanks, ...
# Oddities include: redundant data (percentages)
# Structural oddities include: columns that should be values

** An informal description of a table

1. The data is written as a /table/, which consists of a /header/ and a sequence
   /rows/. 

2. All the rows have the same structure, as determined by the header: a row is
   a sequence of values; and the type of each value is determined by the header.

The next section is a formal version of that specfication. Very few real-world
databases correctly follow this formal version but it is nonetheless helpful to
have it in mind.

The relational model represents facts, of a certain sort. The sort of facts it
represents are those of the form $P(x, y, \dots, z)$ where $P$ is a /predicate/,
ie, either true of false depending on the values asigned to the \(x, y, \dots
z\).

/Example/: Looking at our example table, $H(d, n, p_1, p_2)$ might represent the
proposition “the regional district $d$ has name $n$, and an average house price
in 1996 of $p_1$ and in 2009 of $p_2$.”

/Example/: $P(f, l)$ might mean “there exists a person having first name $f$ and
last name $l$.”

A relational database represents these facts by explicitly storing the
/extension/ of such a $P$; that is, the set of all values of \(x, y, \dots z\)
that make the predicate true. For any other values, the proposition is assumed
to be false. 

The /closed-world assumption:/ If some tuple is not in the database, then the
corresponding proposition if fasle. The closed-world assumption is frequently
violated in real-world databases.


** Formal definition of a relation

The following translation is not exact:

| Conceptual | Logical       | Comment           |
|------------+---------------+-------------------|
| Domain     | Type          |                   |
| Attribute  | Column header |                   |
| Header     | Header        |                   |
| Relation   | Table         | /Header and rows/ |
| Body       | Body          | /Set of rows/     |
| Tuple      | Row           |                   |
| Value      | Field, value  |                   |


A /domain/ is a finite (!) set. All “values” in the relational model are
elements of some particular domain.

We assume the existence of some set of possible “names”. (These are usually
strings satisfying restrictions that make them suitable for computer variables
names.)

An /attribute/ is a pair, consisting of a name and a domain.

A /header/ is a finite set (possibly empty) of attributes, such that all the
names are unique.

A /relation/ is a header, together with a subset of the cartesian product of all
the domains in the header. This subset is called the /body/ of the relation. An
element of the body is called a /tuple/. 

Thus a tuple is, for every attribute in the header, a value in the domain of
that attribute.


#+begin_quote
Question 3: About relations

1. From the *definition* of relation:
   - Does order of tuples matter?
   - Does order of attributes matter? 
   - Is every tuple unique?

2. Is the example dataset a relation? If not, why not?

3. How many relations have *no* attributes? What is/are they? Why would you use
   them?

4. Is it possible for a value to be ~NULL~ or “missing”?
#+end_quote

The point of relations is that they represent collections of facts. The idea of
the /relational algebra/ is to combine one or more relations to produce another
relation. 

#+begin_quote
Question 4: About an algebra of relations

5. What kinds of operation can you imagine on a single relation?

6. What kinds of operation can you imagine on one or more relations?
#+end_quote

# Some ideas for operations:
# - projection onto attributes
# - restriction onto rows (satisfying some other predicate)
# - set union / intersection / difference of bodies
# - divide

** Operations on relations

This is the /relational algebra/. 

It's called an algebra because all the operations produce a relation.


