training/relational-model/relational-notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-11-26 Sun 12:55 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>The Relational Model</title>
<meta name="generator" content="Org mode">
<meta name="author" content="James Geddes">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">The Relational Model</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org174b298">1. Introduction</a>
<ul>
<li><a href="#org5220dfd">1.1. What is data?</a></li>
<li><a href="#org40d598d">1.2. What level are we going to talk about?</a></li>
<li><a href="#orgad9c139">1.3. Challenges</a></li>
</ul>
</li>
<li><a href="#org9764a9d">2. The conceptual model</a>
<ul>
<li><a href="#org0993679">2.1. Example A: House Prices</a></li>
<li><a href="#orgf58c46b">2.2. An informal description of a table</a></li>
<li><a href="#orgc37bec4">2.3. Formal definition of a relation</a></li>
<li><a href="#orgf8b7328">2.4. Operations on relations</a></li>
</ul>
</li>
<li><a href="#orgdfaa49b">3. SQL and the logical model: Getting data out of databases</a>
<ul>
<li><a href="#org60d16e1">3.1. Example B: the "survey" database</a></li>
<li><a href="#org594f164">3.2. SQL: The language of the relational algebra</a>
<ul>
<li><a href="#org111fb9d">3.2.1. Single-table queries</a></li>
<li><a href="#orgb86c103">3.2.2. Multiple table queries</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a9e940">4. Data modelling: Getting data into databases</a>
<ul>
<li><a href="#org23b308d">4.1. NULLs</a></li>
<li><a href="#orga31087c">4.2. Normalisation of tables</a></li>
<li><a href="#org95ccf4b">4.3. Normalisation of databases</a></li>
<li><a href="#orgf7fb260">4.4. Building a database</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org174b298" class="outline-2">
<h2 id="org174b298"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5220dfd" class="outline-3">
<h3 id="org5220dfd"><span class="section-number-3">1.1</span> What is data?</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
Question 1: What is data?
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org40d598d" class="outline-3">
<h3 id="org40d598d"><span class="section-number-3">1.2</span> What level are we going to talk about?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
From abstract to concrete:
</p>

<ol class="org-ol">
<li>The <b>conceptual</b> model is the mathematics of facts: it is expressed using
set-theoretic notions.</li>

<li>The <b>logical</b> model describes how the conceptual model is represented and
manipulated by a computer. It is the level of SQL, the language with which
you interact with the database.</li>

<li>The <b>physical</b> model is the “back-end”: it describes how the bits are
organised within a computer, how your commands are understood and compiled,
and the mechanics of computation on data.</li>
</ol>

<p>
We will talk exclusively about the conceptual and logical levels. The main
challenge in this subject is that very few existing database systems correctly
implement the conceptual model.
</p>
</div>
</div>

<div id="outline-container-orgad9c139" class="outline-3">
<h3 id="orgad9c139"><span class="section-number-3">1.3</span> Challenges</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Most database systems incorrectly implement the conceptual level</li>
<li>Most practitioners know only the logical level</li>
<li>Much real-world code drags in the physical level where it doesn't belong</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org9764a9d" class="outline-2">
<h2 id="org9764a9d"><span class="section-number-2">2</span> The conceptual model</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0993679" class="outline-3">
<h3 id="org0993679"><span class="section-number-3">2.1</span> Example A: House Prices</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Look at <a href="data/median-house-price-by-lad.csv">data/median-house-price-by-lad.csv</a>
</p>

<blockquote>
<p>
Question 2: What does this data look like?
</p>

<ul class="org-ul">
<li>What kind of structure is this?</li>
<li>What regularities can you see?</li>
<li>What anomalies are there?</li>
<li>Would you make any structural changes?</li>
</ul>
</blockquote>
</div>
</div>

<div id="outline-container-orgf58c46b" class="outline-3">
<h3 id="orgf58c46b"><span class="section-number-3">2.2</span> An informal description of a table</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>The data is written as a <i>table</i>, which consists of a <i>header</i> and a sequence
<i>rows</i>.</li>

<li>All the rows have the same structure, as determined by the header: a row is
a sequence of values; and the type of each value is determined by the header.</li>
</ol>

<p>
The next section is a formal version of that specfication. Very few real-world
databases correctly follow this formal version but it is nonetheless helpful to
have it in mind.
</p>

<p>
The relational model represents facts, of a certain sort. The sort of facts it
represents are those of the form \(P(x, y, \dots, z)\) where \(P\) is a <i>predicate</i>,
ie, either true of false depending on the values asigned to the \(x, y, \dots
z\).
</p>

<p>
<i>Example</i>: Looking at our example table, \(H(d, n, p_1, p_2)\) might represent the
proposition “the regional district \(d\) has name \(n\), and an average house price
in 1996 of \(p_1\) and in 2009 of \(p_2\).”
</p>

<p>
<i>Example</i>: \(P(f, l)\) might mean “there exists a person having first name \(f\) and
last name \(l\).”
</p>

<p>
A relational database represents these facts by explicitly storing the
<i>extension</i> of such a \(P\); that is, the set of all values of \(x, y, \dots z\)
that make the predicate true. For any other values, the proposition is assumed
to be false. 
</p>

<p>
The <i>closed-world assumption:</i> If some tuple is not in the database, then the
corresponding proposition if fasle. The closed-world assumption is frequently
violated in real-world databases.
</p>
</div>
</div>


<div id="outline-container-orgc37bec4" class="outline-3">
<h3 id="orgc37bec4"><span class="section-number-3">2.3</span> Formal definition of a relation</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The following translation is not exact:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Conceptual</th>
<th scope="col" class="org-left">Logical</th>
<th scope="col" class="org-left">Comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Domain</td>
<td class="org-left">Type</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Attribute</td>
<td class="org-left">Column header</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Header</td>
<td class="org-left">Header</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Relation</td>
<td class="org-left">Table</td>
<td class="org-left"><i>Header and rows</i></td>
</tr>

<tr>
<td class="org-left">Body</td>
<td class="org-left">Body</td>
<td class="org-left"><i>Set of rows</i></td>
</tr>

<tr>
<td class="org-left">Tuple</td>
<td class="org-left">Row</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Value</td>
<td class="org-left">Field, value</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
A <i>domain</i> is a finite (!) set. All “values” in the relational model are
elements of some particular domain.
</p>

<p>
We assume the existence of some set of possible “names”. (These are usually
strings satisfying restrictions that make them suitable for computer variables
names.)
</p>

<p>
An <i>attribute</i> is a pair, consisting of a name and a domain.
</p>

<p>
A <i>header</i> is a finite set (possibly empty) of attributes, such that all the
names are unique.
</p>

<p>
A <i>relation</i> is a header, together with a subset of the cartesian product of all
the domains in the header. This subset is called the <i>body</i> of the relation. An
element of the body is called a <i>tuple</i>. 
</p>

<p>
Thus a tuple is, for every attribute in the header, a value in the domain of
that attribute.
</p>


<blockquote>
<p>
Question 3: About relations
</p>

<ol class="org-ol">
<li>From the <b>definition</b> of relation:
<ul class="org-ul">
<li>Does order of tuples matter?</li>
<li>Does order of attributes matter?</li>
<li>Is every tuple unique?</li>
</ul></li>

<li>Is the example dataset a relation? If not, why not?</li>

<li>How many relations have <b>no</b> attributes? What is/are they? Why would you use
them?</li>

<li>Is it possible for a value to be <code>NULL</code> or “missing”?</li>
</ol>
</blockquote>

<p>
The point of relations is that they represent collections of facts. The idea of
the <i>relational algebra</i> is to combine one or more relations to produce another
relation. 
</p>

<blockquote>
<p>
Question 4: About an algebra of relations
</p>

<ol class="org-ol">
<li>What kinds of operation can you imagine on a single relation?</li>

<li>What kinds of operation can you imagine on one or more relations?</li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-orgf8b7328" class="outline-3">
<h3 id="orgf8b7328"><span class="section-number-3">2.4</span> Operations on relations</h3>
<div class="outline-text-3" id="text-2-4">
<p>
This is the <i>relational algebra</i>. 
</p>

<p>
It's called an algebra because all the operations produce a relation.
</p>
</div>
</div>
</div>
