training/relational-model/relational-notes.org
* SQL and the logical model: Getting data out of databases


In real-world datasets, we often have the following:

- Rows are not unique
- Column (or row) ordering matters
- Some values are missing or ~NULL~
  
** Example B: the "survey" database

#+begin_quote
Question 5: Using the database

1. Run sqlite (eg, type ~sqlite3 survey.db~ at the command line)

2. Try ~.help~ (note the dot!)

3. Try:
   + ~.databases~
   + ~.tables~
   + ~.schema~

4. Set the display mode:
  + ~.mode column~
  + ~.headers on~
#+end_quote

** SQL: The language of the relational algebra

There is an SQL standard, but particular products may or may not adhere to it
perfectly. The [[https://sqlite.org/lang_select.html][sqlite website]] documents the particular syntax understood by
sqlite.


*** Single-table queries

#+BEGIN_SRC sql
SELECT col-expr [AS name], ... 
FROM tbl
[ WHERE expr ] 
[ GROUP BY col-expr, ... [ HAVING expr ]];
#+END_SRC

Here ~col-expr~ is either the name of a column (eg, ~id~), or an arithmetic (or
string, or date, ...)  expression (eg, ~reading / 1000~), or an aggregation (eg,
~sum(reading)~).

Note that the result is always a table.

#+begin_quote
Question 6: Selecting, computing, and grouping

0. Try: ~SELECT * FROM Person;~ (This is a special syntax.)

1. Select the identifier and the first name from the ~Person~ table.

2. As (2) but rename the first name as ~first_name~.

3. Select the first and last dates from ~Visited~. (Hint: there are functions
   ~max()~ and ~min()~ which also work on dates.)

4. How many readings in total were made by each scientist? (Hint: there's a
   function ~count()~ which counts rows; you can say ~count(*)~.)

5. Will sqlite ever return a table with duplicate rows? If it does, how do you
   get it to return only unique rows?

6. What's the average temperature recorded across all sites and dates by all
   scientists?

7. What's the average reading for each kind of measurement?
#+end_quote

*** Multiple table queries

Union, Intersection, Difference:

#+BEGIN_SRC sql
tbl-expr 
[UNION | INTERSECT | EXCEPT] 
tbl-expr;
#+END_SRC

Joins:

#+BEGIN_SRC sql
SELECT tbl1.col, ... 
FROM tbl-expr [AS tlb1] JOIN tbl-exp [AS tbl2] ...
[ ON tbl1.col = tbl2.col [ AND ... ] ]
#+END_SRC

Here ~tbl-expr~ is a table or another “~SELECT ...~” that produces a table. In
the latter case, you might need to rename it with ~AS~. 

/Example/: here is every visit to every site:

#+BEGIN_SRC sql
SELECT Site.name, Site.lat, Site.long, Visited.id, Visited.dated 
FROM Site JOIN Visited
ON Site.name = Visited.site;
#+END_SRC

#+begin_quote
Question 7: Multiple-table queries

1. Which scientists visited which sites?

2. What's the average (hint: ~avg()~) temperature recorded for each site across
   all visits?

3. For each kind of measurement, which site recorded the highest value of that
   measurement?

4. What does ~SELECT 12 as N;~ do?

5. What on earth is this (and why is there an off-by-one error)?:

  #+begin_src sql
  WITH nmbrs AS 
    (SELECT 1 as N
     UNION 
     SELECT N + 1 FROM nmbrs 
     WHERE N < 10) 
   SELECT * FROM nmbrs;
  #+end_src

#+end_quote


* Data modelling: Getting data into databases 

** NULLs

~NULL~ s are not great. They often arise because a “proper” table has been
“pivoted” so that the values of one column have become column headers.

#+begin_quote
Question 8:

Look at the example [[./data/median-house-price-by-lad.csv]]. Does it have nulls?
Why?

Use Excel (or equivalent) to create a version without nulls. 
#+end_quote 


** Normalisation of tables

In this section, we talk about the real world that is represented by tables. In
the real-world there are often restrictions on the tuples (that is, rows) that
/could/, in principle, occur in a relation. 

“Normal forms” describe ways in which relations and databases avoid containing
redundant information and conforming to the real-world restrictions.

Frustratingly, there are many normal forms. Specifically, there is first,
second, third, fourth, and fifth normal form, plus two others. I shall describe
the two others.


#+begin_quote
Question 9: Look at the example house-prices table (the original or your new
version). 

1. Is there any subset of columns that uniquely identifies -- in
principle -- each row?

2. What is the smallest subset that does so? 

3. Are there any others?
#+end_quote

A /candidate key/ is a set of attributes such that:

 1. the values of the attributes in a tuple uniquely determine the tuple; and
 2. no smaller subset of attributes suffices to do so;

A /superkey/ is some superset of the attributes of a /candidate key/.

*Note:* Some people say /key/ for candidate key, some people use /key/ to mean
superkey. 

Sometimes some set of values in a table depends on some other values. Suppose
$A$ is a set of attributes, and $K$ some other set of attributes. 

If $K$ is a candidate key, then the values in $A$ must depend entirely upon $K$,
becuase the whole tuple does. The following defition goes the other way:

A relation is in /Boyce-Codd normal form/ if, whenever, for any legal tuple, the
values of $A$ are determined entirely by the values of $K$, then $K$ is a
superkey.

#+begin_quote
Question 10: Boyce-Codd normal form.

1. Is the original house-price table in Boyce-Codd normal form? 

2. Is your version without nulls in Boyce-Codd normal form? If not, fix it so
   that it is. (This may require splitting it into more than one table.)

Note: If you like, you can stick with Excel here (or R, or Python). Just make sure you
have a nice copy of your final relations that you can save as a csv.
#+end_quote

Example C: Open up [[file:data/household-income-by-msoa.csv]]

#+begin_quote
Question 11: More normalisation

1. Is this table in Boyce-Codd normal form? If not, fix it so that it is.
#+end_quote

