training/relational-model/relational-notes.html


<div id="outline-container-orgdfaa49b" class="outline-2">
<h2 id="orgdfaa49b"><span class="section-number-2">3</span> SQL and the logical model: Getting data out of databases</h2>
<div class="outline-text-2" id="text-3">
<p>
In real-world datasets, we often have the following:
</p>

<ul class="org-ul">
<li>Rows are not unique</li>
<li>Column (or row) ordering matters</li>
<li>Some values are missing or <code>NULL</code></li>
</ul>
</div>

<div id="outline-container-org60d16e1" class="outline-3">
<h3 id="org60d16e1"><span class="section-number-3">3.1</span> Example B: the "survey" database</h3>
<div class="outline-text-3" id="text-3-1">
<blockquote>
<p>
Question 5: Using the database
</p>

<ol class="org-ol">
<li>Run sqlite (eg, type <code>sqlite3 survey.db</code> at the command line)</li>

<li>Try <code>.help</code> (note the dot!)</li>

<li>Try:
<ul class="org-ul">
<li><code>.databases</code></li>
<li><code>.tables</code></li>
<li><code>.schema</code></li>
</ul></li>

<li>Set the display mode:
<ul class="org-ul">
<li><code>.mode column</code></li>
<li><code>.headers on</code></li>
</ul></li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-org594f164" class="outline-3">
<h3 id="org594f164"><span class="section-number-3">3.2</span> SQL: The language of the relational algebra</h3>
<div class="outline-text-3" id="text-3-2">
<p>
There is an SQL standard, but particular products may or may not adhere to it
perfectly. The <a href="https://sqlite.org/lang_select.html">sqlite website</a> documents the particular syntax understood by
sqlite.
</p>
</div>


<div id="outline-container-org111fb9d" class="outline-4">
<h4 id="org111fb9d"><span class="section-number-4">3.2.1</span> Single-table queries</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">SELECT</span> col-expr [<span style="color: #859900;">AS</span> <span style="color: #859900;">name</span>], ... 
<span style="color: #859900;">FROM</span> tbl
[ <span style="color: #859900;">WHERE</span> expr ] 
[ <span style="color: #859900;">GROUP</span> <span style="color: #859900;">BY</span> col-expr, ... [ <span style="color: #859900;">HAVING</span> expr ]];
</pre>
</div>

<p>
Here <code>col-expr</code> is either the name of a column (eg, <code>id</code>), or an arithmetic (or
string, or date, &#x2026;)  expression (eg, <code>reading / 1000</code>), or an aggregation (eg,
<code>sum(reading)</code>).
</p>

<p>
Note that the result is always a table.
</p>

<blockquote>
<p>
Question 6: Selecting, computing, and grouping
</p>

<ol class="org-ol">
<li>Try: <code>SELECT * FROM Person;</code> (This is a special syntax.)</li>

<li>Select the identifier and the first name from the <code>Person</code> table.</li>

<li>As (2) but rename the first name as <code>first_name</code>.</li>

<li>Select the first and last dates from <code>Visited</code>. (Hint: there are functions
<code>max()</code> and <code>min()</code> which also work on dates.)</li>

<li>How many readings in total were made by each scientist? (Hint: there's a
function <code>count()</code> which counts rows; you can say <code>count(*)</code>.)</li>

<li>Will sqlite ever return a table with duplicate rows? If it does, how do you
get it to return only unique rows?</li>

<li>What's the average temperature recorded across all sites and dates by all
scientists?</li>

<li>What's the average reading for each kind of measurement?</li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-orgb86c103" class="outline-4">
<h4 id="orgb86c103"><span class="section-number-4">3.2.2</span> Multiple table queries</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Union, Intersection, Difference:
</p>

<div class="org-src-container">
<pre class="src src-sql">tbl-expr 
[<span style="color: #859900;">UNION</span> | <span style="color: #859900;">INTERSECT</span> | <span style="color: #859900;">EXCEPT</span>] 
tbl-expr;
</pre>
</div>

<p>
Joins:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">SELECT</span> tbl1.col, ... 
<span style="color: #859900;">FROM</span> tbl-expr [<span style="color: #859900;">AS</span> tlb1] <span style="color: #859900;">JOIN</span> tbl-exp [<span style="color: #859900;">AS</span> tbl2] ...
[ <span style="color: #859900;">ON</span> tbl1.col = tbl2.col [ <span style="color: #859900;">AND</span> ... ] ]
</pre>
</div>

<p>
Here <code>tbl-expr</code> is a table or another “~SELECT &#x2026;~” that produces a table. In
the latter case, you might need to rename it with <code>AS</code>. 
</p>

<p>
<i>Example</i>: here is every visit to every site:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">SELECT</span> Site.<span style="color: #859900;">name</span>, Site.lat, Site.long, Visited.id, Visited.dated 
<span style="color: #859900;">FROM</span> Site <span style="color: #859900;">JOIN</span> Visited
<span style="color: #859900;">ON</span> Site.<span style="color: #859900;">name</span> = Visited.site;
</pre>
</div>

<blockquote>
<p>
Question 7: Multiple-table queries
</p>

<ol class="org-ol">
<li>Which scientists visited which sites?</li>

<li>What's the average (hint: <code>avg()</code>) temperature recorded for each site across
all visits?</li>

<li>For each kind of measurement, which site recorded the highest value of that
measurement?</li>

<li>What does <code>SELECT 12 as N;</code> do?</li>

<li><p>
What on earth is this (and why is there an off-by-one error)?:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">WITH</span> nmbrs <span style="color: #859900;">AS</span> 
  (<span style="color: #859900;">SELECT</span> 1 <span style="color: #859900;">as</span> N
   <span style="color: #859900;">UNION</span> 
   <span style="color: #859900;">SELECT</span> N + 1 <span style="color: #859900;">FROM</span> nmbrs 
   <span style="color: #859900;">WHERE</span> N &lt; 10) 
 <span style="color: #859900;">SELECT</span> * <span style="color: #859900;">FROM</span> nmbrs;
</pre>
</div></li>
</ol>
</blockquote>
</div>
</div>
</div>
</div>


<div id="outline-container-org7a9e940" class="outline-2">
<h2 id="org7a9e940"><span class="section-number-2">4</span> Data modelling: Getting data into databases</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org23b308d" class="outline-3">
<h3 id="org23b308d"><span class="section-number-3">4.1</span> NULLs</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>NULL</code> s are not great. They often arise because a “proper” table has been
“pivoted” so that the values of one column have become column headers.
</p>

<blockquote>
<p>
Question 8:
</p>

<p>
Look at the example <a href="./data/median-house-price-by-lad.csv">./data/median-house-price-by-lad.csv</a>. Does it have nulls?
Why?
</p>

<p>
Use Excel (or equivalent) to create a version without nulls. 
</p>
</blockquote>
</div>
</div>


<div id="outline-container-orga31087c" class="outline-3">
<h3 id="orga31087c"><span class="section-number-3">4.2</span> Normalisation of tables</h3>
<div class="outline-text-3" id="text-4-2">
<p>
In this section, we talk about the real world that is represented by tables. In
the real-world there are often restrictions on the tuples (that is, rows) that
<i>could</i>, in principle, occur in a relation. 
</p>

<p>
“Normal forms” describe ways in which relations and databases avoid containing
redundant information and conforming to the real-world restrictions.
</p>

<p>
Frustratingly, there are many normal forms. Specifically, there is first,
second, third, fourth, and fifth normal form, plus two others. I shall describe
the two others.
</p>


<blockquote>
<p>
Question 9: Look at the example house-prices table (the original or your new
version). 
</p>

<ol class="org-ol">
<li>Is there any subset of columns that uniquely identifies &#x2013; in</li>
</ol>
<p>
principle &#x2013; each row?
</p>

<ol class="org-ol">
<li>What is the smallest subset that does so?</li>

<li>Are there any others?</li>
</ol>
</blockquote>

<p>
A <i>candidate key</i> is a set of attributes such that:
</p>

<ol class="org-ol">
<li>the values of the attributes in a tuple uniquely determine the tuple; and</li>
<li>no smaller subset of attributes suffices to do so;</li>
</ol>

<p>
A <i>superkey</i> is some superset of the attributes of a <i>candidate key</i>.
</p>

<p>
<b>Note:</b> Some people say <i>key</i> for candidate key, some people use <i>key</i> to mean
superkey. 
</p>

<p>
Sometimes some set of values in a table depends on some other values. Suppose
\(A\) is a set of attributes, and \(K\) some other set of attributes. 
</p>

<p>
If \(K\) is a candidate key, then the values in \(A\) must depend entirely upon \(K\),
becuase the whole tuple does. The following defition goes the other way:
</p>

<p>
A relation is in <i>Boyce-Codd normal form</i> if, whenever, for any legal tuple, the
values of \(A\) are determined entirely by the values of \(K\), then \(K\) is a
superkey.
</p>

<blockquote>
<p>
Question 10: Boyce-Codd normal form.
</p>

<ol class="org-ol">
<li>Is the original house-price table in Boyce-Codd normal form?</li>

<li>Is your version without nulls in Boyce-Codd normal form? If not, fix it so
that it is. (This may require splitting it into more than one table.)</li>
</ol>

<p>
Note: If you like, you can stick with Excel here (or R, or Python). Just make sure you
have a nice copy of your final relations that you can save as a csv.
</p>
</blockquote>

<p>
Example C: Open up <a href="data/household-income-by-msoa.csv">data/household-income-by-msoa.csv</a>
</p>

<blockquote>
<p>
Question 11: More normalisation
</p>

<ol class="org-ol">
<li>Is this table in Boyce-Codd normal form? If not, fix it so that it is.</li>
</ol>
</blockquote>
</div>
</div>
