training/relational-model/relational-notes.org
** Normalisation of databases

Sometimes tables are obviously connected to each other.

A /foreign key/ is a set of attributes that is a candidate key in some other
table. Usually, when we identify foreign keys, we also mean to assert that every
tuple from a table with a foreign key has that corresponding tuple actually
present in the other table. This is called /referential integrity/.

#+begin_quote 
Question 12: Look at the collection of tables you have built. In
which tables are there foriegn keys?
#+end_quote

A relation is in /Domain-Key normal form/ if every real-world restriction is a
consequence of the definitions of keys and domains.

** Building a database 

#+begin_quote
Question 13: The last exercise

1. Build an sqlite database from the tables you have constructed. Use the DB
   manager application. (Most RDBMS don't let you play fast and loose with types
   and schema -- sqlite does.)

2. What is the average house price in 2009 by Government Office Region?

3. For each GOR, what is its percentage increase in house-price:income
   ratio between 1996 and 2009?
#+end_quote








 
