training/relational-model/relational-notes.html

<div id="outline-container-org95ccf4b" class="outline-3">
<h3 id="org95ccf4b"><span class="section-number-3">4.3</span> Normalisation of databases</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Sometimes tables are obviously connected to each other.
</p>

<p>
A <i>foreign key</i> is a set of attributes that is a candidate key in some other
table. Usually, when we identify foreign keys, we also mean to assert that every
tuple from a table with a foreign key has that corresponding tuple actually
present in the other table. This is called <i>referential integrity</i>.
</p>

<blockquote>
<p>
Question 12: Look at the collection of tables you have built. In
which tables are there foriegn keys?
</p>
</blockquote>

<p>
A relation is in <i>Domain-Key normal form</i> if every real-world restriction is a
consequence of the definitions of keys and domains.
</p>
</div>
</div>

<div id="outline-container-orgf7fb260" class="outline-3">
<h3 id="orgf7fb260"><span class="section-number-3">4.4</span> Building a database</h3>
<div class="outline-text-3" id="text-4-4">
<blockquote>
<p>
Question 13: The last exercise
</p>

<ol class="org-ol">
<li>Build an sqlite database from the tables you have constructed. Use the DB
manager application. (Most RDBMS don't let you play fast and loose with types
and schema &#x2013; sqlite does.)</li>

<li>What is the average house price in 2009 by Government Office Region?</li>

<li>For each GOR, what is its percentage increase in house-price:income
ratio between 1996 and 2009?</li>
</ol>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 27 November 2017</p>
<p class="author">Author: James Geddes</p>
<p class="date">Created: 2017-11-26 Sun 12:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
